# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   # split at 3: 
   [-1, 1, VAEModule, [256, 2, 1, 0, 1, 4]],
   [-1, 6, C3, [256]], # fenzhi
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
    # split at 5: 
   [-1, 9, C3, [512]],   # fenzhi
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
    # split at 7
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 10

   [-1, 1, DeConv, [1024, 1, 1]], # 11 - 9
   [-1, 1, DeconvSPPF, [1024, 5]], # 12 - 8
   [-1, 3, DeconvC3, [1024]], # 13 - 7
   [-1, 1, DeConv, [512, 3, 2]], # 14 - 6
   [-1, 9, DeconvC3, [512]], # 15 - 5
   [-1, 1, DeConv, [256, 3, 2]], # 16 - 4

   [10, 1, nn.Upsample, [None, 2, 'nearest']],  # 17 11
   [[-1, 14], 1, Concat, [1]], 
   [-1, 3, C3, [512, False]],  # 19 - 13

   [-1, 1, Conv, [256, 1, 1]],  # 20 - 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 16], 1, Concat, [1]], 
   [-1, 3, C3, [256, False]],  # 23 - 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 20], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 26 - 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 29 - 23 (P5/32-large)

  #  [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  [[23, 26, 29], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
